<?php

namespace App\Helpers;

class ResponseEnum
{
    /*----------------------------------------2XX---------------------------------------------------*/
    // 表示服务器成功地接受了客户端请求
    public const HTTP_SUCCESS = [200, '操作成功'];
    public const HTTP_ERROR = [416, '操作失败'];
    public const HTTP_ACTION_COUNT_ERROR = [417, '操作频繁'];

    /*----------------------------------------3XX---------------------------------------------------*/
    // 301 - 永久重定向
    // 302 - 对象已移动
    // 304 - 未修改
    // 307 - 临时重定向

    /*----------------------------------------4XX---------------------------------------------------*/
    // 400 - 请求报文语法错误或参数错误
    public const CLIENT_PARAMETER_ERROR = [400, '参数错误'];
    // 401 - 认证失败
    public const CLIENT_HTTP_UNAUTHORIZED = [401, '授权失败,请先登录'];
    // 403 - 请求资源被拒绝
    // 404 - 无法找到请求资源（服务器无理由拒绝）
    public const CLIENT_NOT_FOUND_ERROR = [404, '没有找到该页面'];
    // 405 - 用来访问本页面的 HTTP 谓词不被允许（方法不被允许）
    public const CLIENT_METHOD_HTTP_TYPE_ERROR = [405, 'HTTP请求类型错误'];

    /*-----------------------------------------5XX--------------------------------------------------*/
    // 500 - 服务器故障或Web应用故障
    public const SYSTEM_ERROR = [500, '服务器错误'];
    // 501 - 页眉值指定了未实现的配置
    // 502 - Web 服务器用作网关或代理服务器时收到了无效响应
    // 503 - 服务器超负载或停机维护
    public const SYSTEM_UNAVAILABLE = [503, '服务器正在维护中'];
    // 504 - 网关超时
    // 505 - HTTP 版本不受支持
    /*----------------------------------------------------------------------------------------------*/
}
